<?php

/**
 * @package    ArtInWebCMS.doc
 *
 * @copyright  (C) 2024 Igor Kruk <https://cms.artinweb.biz>
 * @license    GNU General Public License version 2 or later; see LICENSE.txt
 */
defined('AIW_CMS') or die;

use Core\Plugins\View\Tpl;

$header = Tpl::view(PATH_INC . 'doc' . DS . 'about-us.php');
?>
<div class="uk-padding" itemscope="" itemtype="http://schema.org/Offer">
    <?= $header ?>
    <div itemprop="description">
        <p>При створенні цієї програми ми керувались кількома основними критеріями:</p>
        <ul class="uk-list uk-list-striped">
            <li><a href="#safety" uk-scroll>Безпека</a></li>
            <li><a href="#speed" uk-scroll>Швидкість</a></li>
            <li><a href="#simplicity" uk-scroll>Простота</a></li>
        </ul>
        <h2 id="safety">1. Безпека</h2>
        <h3>Ddos</h3>
        <p>Внутрішня система сесій &ndash; перша лінія захисту від Ddos атак. Якщо користувач звертається до сайту з проміжком часу менше кількох секунд &ndash; йому відображається сторінка з попередженням. Кількість попереджень фіксується у сесії. Після певної кількості попереджень &ndash; користувачу виводиться сторінка про блокування на 15-ть хвилин. При кожному зверненні користувача до сайту до закінчення терміну блокування &ndash; термін блокування обнуляється. В обробці заблокованих запитів приймають участь лише кілька файлів програми та відправляється лише текстова інформація з повідомленням про блокування. Це зводить до мінімуму зворотній трафік сервера, що у свою чергу, дає йому можливість ефективно справлятись з максимально можливою кількістю запитів. Таким чином, для організації повного падіння сервера потрібно буде використати набагато більші ресурси, ніж для традиційних CMS.</p>
        <p>Якщо при атаці з кожним запитом cookie файли на стороні користувача видаляються або не зберігаються, то у цьому випадку, оскільки кожна сесія чітко прив&rsquo;язується до IP користувача, після кількох з&rsquo;єднань з одного і того ж IP починається відлік 15-ти хвилинного блокування користувача за цим IP. Наступний доступ користувача з таким IP до сайту буде можливим лише після того, як спливе термін всіх попередніх сесій з цього IP.</p>
        <p>Таким чином, ефективна Ddos з обмеженої кількості IP стає просто не можливою.</p>
        <h3>Injection Attacks</h3>
        <p>Всі дані, що потрапляють від користувача &ndash; обов&rsquo;язково обробляються та фільтруються. У базу даних потрапляє лише оброблений чистий текст у форматі HTML без можливості будь яких домішок.</p>
        <h3>Cross-Site Scripting, XSS</h3>
        <h4>- Reflected XSS</h4>
        <p>Коректність URL &ndash; наступний рівень захисту ArtInWeb CMS. Всі дані, які користувач може використовувати в URL чітко структуровані та типізовані. Будь які відхилення від заданих параметрів перенаправляють користувача на головну сторінку, а у сесію записується інформація про блокування. При досягненні певної кількості блокувань &ndash; цей користувач заблоковується на 15-ть хвилин. Наслідки дивіться вище.</p>
        <h4>- Stored XSS / DOM-Based XSS</h4>
        <p>Користувачам на сайті для внесення інформації та її форматування, дозволено використовувати лише обмежену кількість тегів HTML. Всі інші теги видаляються, а текст, який був в них &ndash; перетворюється у звичайний текст без форматування. Крім цього, програма повністю очищує всі внутрішні атрибути тегів HTML, повертаючи для запису у БД лише чистий HTML без будь яких стилів, додаткових форматувань, знаків, символів тощо.</p>
        <h4>- Cross-Site Request Forgery, CSRF</h4>
        <p>Як було сказано вище, сесія користувача чітко прив&rsquo;язана до його IP. Якщо токен форми не відповідає сесії користувача &ndash; такі дані від користувача сайтом оброблені не будуть, а користувачу буде виведене відповідне попередження та записано у сесії. Після отримання кількох блокувань &ndash; користувач буде заблокований на 15-ть хвилин.</p>
        <h3>Brute Force Attacks</h3>
        <p>Brute Force Attacks (перебір паролю) &ndash; можлива лише у тому випадку, якщо програма дозволяє проводити безліч запитів до сайту за короткий проміжок часу. Якщо ж ми обмежуємо кількість таких запитів до одного у кілька секунд &ndash; цей вид атаки втрачає будь який сенс, проте жодним чином не впливає на звичайних користувачів. Якщо для Brute Force Attacks зловмисник використовує кілька IP &ndash; у гру вступають правила, що були описані вище.</p>
        <h3>Man-in-the-Middle Attack, MitM</h3>
        <p>Цей вид атак ефективно вирішується використанням протоколу з&rsquo;єднання HTTPS. Для захисту від цього виду атак програма використовує автоматичне перенаправлення на цей протокол з&rsquo;єднання, якщо відповідне налаштування вказане у конфігураційному файлі &laquo;config.php&raquo; у ключі &laquo;http_type&raquo;. Якщо значення цього ключа буде &laquo;https://&raquo; &ndash; передача даних з сайту та на сайт буде відбуватись лише через протокол HTTPS, що практично унеможливить будь-яке перехоплення даних на проміжних етапах.</p>
        <h3>Авторизована реєстрація</h3>
        <p>Програма використовує систему реєстрації на основі унікальної адреси електронної пошти (email) для кожного зареєстрованого користувача. При цьому новий зареєстрований користувач не вказує пароль для входу на сайт. Адреси типу &laquo;<strong>username@email.com</strong>&raquo;, &laquo;<strong>user.name@email.com</strong>&raquo;, &laquo;<strong>us-er-na.me@email.com</strong>&raquo; і т.п., сприймаються програмою як одна адреса електронної пошти.</p>
        <p>При реєстрації для користувача формується пароль для входу на сайт і висилається на вказаний у формі реєстрації email. Якщо новий користувач не увійде на сайт з вказаним паролем впродовж 48-ми годин після реєстрації, його обліковий запис буде автоматично видалено.</p>
        <p>Таким чином, користувачі можуть використовувати при реєстрації лише верифіковані адреси електронної пошти, які реально існують. У протилежному випадку, їхні облікові записи видаляються і ніяк у подальшому не можуть використовуватись для будь-якого впливу на сайт.</p>
        <p>Якщо авторизований користувач заходить на сайт з іншого IP, ніж був при крайній сесії &ndash; йому знову потрібно буде авторизуватись на сайті, вказавши свій email та пароль.</p>
        <p>Кожен користувач у будь-який момент може змінити свій пароль через відповідну форму на сайті у своєму меню користувача.</p>
        <p>Єдине обов&rsquo;язкове поле при реєстрації нового користувача, є його email. Всі інші поля, наприклад ім&rsquo;я, прізвище, телефон тощо, можуть вноситись за побажанням у будь-якій комбінації.</p>
        <h2 id="speed">2. Швидкість</h2>
        <p>На швидкість завантаження сторінки для кінцевого користувача у першу чергу впливає кількість інформації (вага сторінки), що отримується браузером. Щоб максимально зменшити кількість JS скриптів, для коректного формування сторінок на боці користувача ми використовуємо лише один CSS/JS фреймворк - <strong>UIkit</strong>.</p>
        <p>&laquo;ArtInWeb CMS&raquo; побудована на чистому PHP.</p>
        <p>Мова програмування PHP була створена для об&rsquo;єднання можливості перетворення складних речей у прості форми. Іншими словами, отримання інформації (і зворотне внесення даних) з/у бази даних та перетворення цієї інформації у простий HTML.</p>
        <p>У перших варіантах мова програмування PHP зовсім не була ефективною у плані навантажень та кількості обробки даних. Тому, з метою покращення цих речей були створені безліч &laquo;систем підключення класів&raquo;, &laquo;шаблонизаторів&raquo;, фреймворків тощо.</p>
        <p>За крайні кілька років, починаючи з версії PHP 8.0 ця мова програмування перетворилась в одного з лідерів по продуктивності!</p>
        <p>Саме для того, щоб спробувати повернути створення сайтів у світ чистого PHP/HTML/CSS/JS і був створений цей проект.</p>
        <p>Використання мінімальної кількості файлів у обробці інформації, що отримується та передається &ndash; повинна максимально збільшити можливості проектів, які будуть побудовані на основі цієї системи управління контентом.</p>
        <h2 id="simplicity">3. Простота</h2>
        <p>Як було сказано у попередньому розділі, для отримання контенту з БД та формування вихідного коду HTML ця CMS використовує мінімальну кількість файлів з мінімальними залежностями. Отже, навіть при мінімальному знанні PHP можна розібратись як ефективно розширити функціонал, що вже існує, саме під свої потреби.</p>
        <p>При написанні цієї програми ми використовували безліч готових рішень. Проте, оскільки ми практично все переробили до &laquo;невпізнання&raquo; &ndash; якихось авторських міток других людей ми не залишили. :( Якщо ж ви знайшли десь свій код у &laquo;первозданному вигляді&raquo; &ndash; маячте. Ми з задоволенням вкажемо вас у співавторах певної частини коду.</p>
        <p>Для більшості операцій зі створення <strong>СВОГО</strong> типу контенту у цій CMS, вам потрібно:</p>
        <ul>
            <li>елементарне знання HTML &amp; CSS;</li>
            <li>мінімальне знання PHP;</li>
            <li>експертне вміння натискання клавіш &laquo;Ctrl+C&raquo; та &laquo;Ctrl+V&raquo;.</li>
        </ul>
        <p>Ніщо ми не вміємо краще, ніж копіпастити :)</p>
        <p>Всі необхідні приклади сніпетів для створення нових типів контенту будь якої складності у &laquo;AIW CMS&raquo; вже є у папці &laquo;dev&raquo; цього репозиторію.</p>
        <h2>Отже.</h2>
        <p>Можливо (і швидше за все), ви знайдете якісь помилки коду, шляхи його покращення та додавання нових функцій. Все це, безперечно, так, оскільки практично весь цей код (станом на V0.1) написаний або перероблений однією людиною. Тому, радо прийматиму та розглядатиму будь-які ваші ідеї. Але&hellip; Якщо вони залишатимуться у руслі універсального продукту.</p>
        <p>На основі цієї CMS нами вже створено кілька вузькоспеціалізованих сайтів, які вже показали свою високу ефективність у протидії різного роду атакам зловмисників, але їхній спеціалізований код завжди залишатиметься комерційним.</p>
        <p><strong>У цьому ж репозиторії ви отримуєте:</strong></p>
        <ul>
            <li>система управління багатомовним або одномовним контентом сайту;</li>
            <li>система кешування контенту;</li>
            <li>система реєстрації та управління користувачами з безліччю комбінацій типів користувачів та умов доступу і редагування контенту;</li>
            <li>система шаблонів (один для багатьох, або унікальний (у будь-яких комбінаціях)) для будь-якого типу контенту;</li>
            <li>універсальні шаблони &laquo;Політики конфіденційності&raquo;, &laquo;Угода користувача&raquo;, &laquo;Умови використання файлів cookie&raquo; та &laquo;Заборонені і дозволені на сайті HTML-теги&raquo;. Перші три сторінки є обов&rsquo;язковими для розміщення на всіх сайтах ЄС;</li>
            <li>приклад головної сторінки, на яку можуть дуже легко виводитись дані з самих різних типів контенту;</li>
            <li>систему формування меню:
                <ul>
                    <li>головне меню (випадаюче зліва);</li>
                    <li>головне меню (горизонтальне згори);</li>
                    <li>меню користувача (випадаюче зправа);</li>
                    <li>меню зміни мови інтерфейсу (контенту).</li>
                </ul>
            </li>
            <li>меню &laquo;хлібних кришок&raquo;;</li>
            <li>меню пагінації сторінок;</li>
            <li>адміністративне меню (під головним меню зліва);</li>
            <li>система зворотного зв'язку:
                <ul>
                    <li>контакти (адаптовані для пошукових систем);</li>
                    <li>форма повідомлень (для зареєстрованих користувачів) до власників або менеджерів сайту.</li>
                </ul>
            </li>
            <li>система управління повідомленнями (тікетами) до адміністрації сайту;</li>
            <li>система відгуків;</li>
            <li>система управління відгуками;</li>
            <li>система управління системними параметрами;</li>
            <li>система логів відвідування сайту користувачами;</li>
            <li>система логів відвідування сайту користувачами, що відносяться до групи менеджерів;</li>
            <li>система логів індексування сайті пошуковими ботами;</li>
            <li>система моніторингу індексування контенту та створення на її основі мапи сайту (sitemap.txt) у режимі реального часу;</li>
            <li>систему багатомовного (одномовного) контенту типу &laquo;Блог&raquo; з можливістю його простого розширення до будь-якого за складністю типу контенту з безліччю фільтрів;</li>
            <li>система повідомлень про помилки у роботі сайту;</li>
            <li>система шифрування з плаваючим ключем для зберігання конфіденційних даних користувачів;</li>
            <li>система відображення сайту у режимі редагування. Режим редагування може бути двох типів:
                <ul>
                    <li>тотальний &ndash; перша сторінка одна для всіх без форми авторизації;</li>
                    <li>персональний &ndash; сторінка редагування з формою авторизації. Загальна сторінка режиму редагування відображається лише для неавторизованих користувачів, та користувачів, що не мають прав доступу до цього режиму роботи сайту.</li>
                </ul>
            </li>
        </ul>
        <p><strong>Все перелічене &ndash; далеко не повний набір!</strong></p>
        <p>Поступово ми будемо розповідати на сторінках сайту <a href="https://cms.artinweb.biz">cms.artinweb.biz</a> що і як краще і швидше робити.</p>
        <p>Дивіться. Читайте. Створюйте. Діліться. І&hellip; насолоджуйтесь життям!</p>
        <p>Воно одне і унікальне!</p>
        <p>Цінуйте рідних і спілкування з ними!</p>
        <p>Мирного неба і &hellip;</p>
        <p><strong>СЛАВА УКРАЇНІ !!!<br />ГЕРОЯМ СЛАВА !!!</strong></p>
    </div>
</div>
