<?php

/**
 * @package    ArtInWebCMS.doc
 *
 * @copyright  (C) 2024 Igor Kruk <https://cms.artinweb.biz>
 * @license    GNU General Public License version 2 or later; see LICENSE.txt
 */
defined('AIW_CMS') or die;

use Core\Plugins\View\Tpl;

$header = Tpl::view(PATH_INC . 'doc' . DS . 'about-us.php');
?>
<div class="uk-padding" itemscope="" itemtype="http://schema.org/Offer">
    <?= $header ?>
    <div itemprop="description">
        <h3 class="uk-text-center">Давайте знайомитись!</h3>
        <p>Ми — сімейна пара, Володимир та Ольга.</p>
        <p>У далекому 2001 році приїхали до Португалії (Володимир із Росії, Ольга з України). Тут ми познайомилися, тут народилася наша сім'я та народився наш син. Нас завжди об'єднували спільні захоплення та любов до Португалії.</p>
        <p>У туризм ми прийшли поступово. Спочатку нам самим було дуже цікаво дослідити цю дивовижну країну. При кожній нагоді ми вирушали в інші міста, відвідували визначні пам'ятки та нові місця.</p>
        <p>Ми вивчили та полюбили Португалію, опанували місцеву мову, навчилися розуміти культурні особливості країни. Перший час своїми відкриттями ми ділилися з друзями та знайомими, які оцінили наше захоплення і тоді ми вирішили зайнятися цим серйозніше.</p>
        <p>Ольга – педагог за освітою, має диплом філолога та португальський диплом у сфері туризму. Володимир – завжди захоплювався історією та багато читав. Зараз ділиться своїми знаннями на екскурсіях та вміє захопити розповіддю не лише дорослих, а й дітей.</p>
        <p>Спеціально для вас ми розробили захоплюючі екскурсії, які складені так, щоб ви змогли побачити максимальну кількість найцікавіших місць та об'єктів. Окрім відомих екскурсійних напрямків ми з радістю покажемо вам пам'ятки, про які замовчують путівники та проведемо вас найзаповіднішими місцями.</p>
        <p>Під час наших екскурсій ми будемо відвідувати старовинні замки та розкішні палаци, милуватися незайманою природою, захоплюватися могутністю Атлантичного океану та дегустувати місцеві вина та делікатеси.</p>
        <p>А якщо ви подорожуєте з дітьми, то у нас ви знайдете спеціальні дитячі та сімейні екскурсії. Які ми перетворили на захоплюючі прогулянки з інтерактивними завданнями, вікторинами, іграми та, звичайно, цікавими призами. Але найголовніше: наші екскурсії настільки ж пізнавальні та корисні як для дітей, так і для дорослих!</p>
        <p>Ми допоможемо вам побачити, зрозуміти та полюбити Португалію! Приїжджайте та переконайтесь у цьому самі!</p>
        <p class="uk-text-bold uk-text-right">Володимир та Ольга Грязнови</p>
    </div>
</div>
