<h1 class="uk-text-center">Політика щодо обробки Персональних даних</h1>
<h3>1. Загальні положення</h3>
<p>Ця політика обробки Персональних даних складена відповідно до вимог Законів Європейського Союзу «Про захист Персональних даних» та/або аналогічних, та визначає порядок обробки Персональних даних та заходи щодо забезпечення безпеки Персональних даних, що вживаються сайтом <strong>andorinha-pt.com</strong> (далі – Оператор).</p>
<p>1.1. Оператор ставить своєю найважливішою метою та умовою здійснення своєї діяльності дотримання прав і свобод людини та громадянина при обробці його Персональних даних, у тому числі захисту прав на недоторканність приватного життя, особисту та сімейну таємницю.</p>
<p>1.2. Справжня політика Оператора щодо обробки Персональних даних (далі – Політика) застосовується до всієї інформації, яку Оператор може отримати про відвідувачів веб-сайтів домену https://andorinha-pt.com та всіх його під-доменів.</p>
<h3>2. Основні поняття, які використовуються в Політиці</h3>
<p>2.1. <em>Автоматизована обробка Персональних даних</em> – обробка Персональних даних за допомогою засобів обчислювальної техніки;</p>
<p>2.2. <em>Блокування Персональних даних</em> – тимчасове припинення обробки Персональних даних (за винятком випадків, якщо обробка необхідна для уточнення Персональних даних);</p>
<p>2.3. <em>Веб-сайт</em> – сукупність графічних та інформаційних матеріалів, а також програм для ЕОМ та баз даних, що забезпечують їх доступність в мережі інтернет за мережевою адресою https://andorinha-pt.com та його під-доменах;</p>
<p>2.4. <em>Інформаційна система Персональних даних</em> — сукупність персональних даних, що містяться в базах даних, і забезпечують їх обробку інформаційних технологій та технічних засобів;</p>
<p>2.5. <em>Знеособлення Персональних даних</em> — дії, внаслідок яких неможливо визначити без використання додаткової інформації належність Персональних даних конкретному Користувачеві або іншому суб'єкту Персональних даних;</p>
<p>2.6. <em>Обробка Персональних даних</em> – будь-яка дія (операція) або сукупність дій (операцій), що здійснюються з використанням засобів автоматизації та/або без використання таких засобів з персональними даними, включаючи збір, запис, систематизацію, накопичення, зберігання, уточнення (оновлення, зміна, обликування, блокування, видалення, знищення Персональних даних;</p>
<p>2.7. <em>Оператор</em> – державний орган, муніципальний орган, юридична або фізична особа, що самостійно або спільно з іншими особами організовують та/або здійснюють обробку Персональних даних, а також визначальні цілі обробки Персональних даних, склад Персональних даних, що підлягають обробці персональними, дії;
<p>2.8. <em>Персональні дані</em> – будь-яка інформація, що стосується прямо або опосередковано до певного або визначеного Користувачеві веб-сайту https://andorinha-pt.com та його під-доменів;</p>
<p>2.9. <em>Користувач</em> – будь-який відвідувач веб-сайту https://andorinha-pt.com та його під-доменів;</p>
<p>2.10. <em>Надання Персональних даних</em> – дії, спрямовані на розкриття Персональних даних певній особі або певному колу осіб;</p>
<p>2.11. <em>Поширення Персональних даних</em> – будь-які дії, спрямовані на розкриття Персональних даних невизначеному колу осіб (передача Персональних даних) або на ознайомлення з персональними даними необмеженого кола осіб, у тому числі оприлюднення Персональних даних у засобах масової інформації, розміщення в інформаційному ;</p>
<p>2.12. <em>Транскордонна передача Персональних даних</em> – передача Персональних даних на територію іноземної держави органу влади іноземної держави, іноземній фізичній або іноземній юридичній особі;</p>
<p>2.13. <em>Знищення Персональних даних</em> – будь-які дії, в результаті яких персональні дані знищуються безповоротно з неможливістю подальшого відновлення змісту Персональних даних в інформаційній системі Персональних даних та/або знищуються матеріальні носії Персональних даних.</p>
<h3>3. Які Персональні дані Користувача обробляються</h3>
<p>Для коректної роботи сайту та надання послуг Оператором на належному рівні, Оператор може обробляти такі Персональні дані Користувача:</p>
<p>3.1. Прізвище, ім'я, по батькові;<br>
    3.2. Адреса електронної пошти;<br>
    3.3. Номер телефону;<br>
    3.4. Фотографії;<br>
    3.5. Також на сайті відбувається збір та обробка знеособлених даних про відвідувачів, в т.ч. файлів cookie.</p>
<p>Вищеперелічені дані далі за текстом Політики об'єднані загальним поняттям <em>Персональні дані</em>.</p>
<h3>4. Цілі обробки персональних даних</h3>
<p>4.1. Мета обробки Персональних даних Користувача:<br>
    – інформування Користувача за допомогою надсилання електронних листів;<br>
    – надання доступу Користувачеві до сервісів, інформації та/або матеріалів, що містяться на веб-сайті;<br>
    – захист прав Користувачів та їх контрагентів від зловмисників.</p>
<p>4.2. Також Оператор має право надсилати Користувачеві повідомлення про нові продукти та послуги, спеціальні пропозиції та різні події. Користувач завжди може відмовитися від отримання інформаційних повідомлень, надіславши Оператору лист з контактної форми на сайті з позначкою «Відмова від повідомлень про нові продукти та послуги та спеціальні пропозиції».</p>
<p>4.3. Знеособлені дані Користувачів, які збираються за допомогою сервісів інтернет-статистики, служать для збору інформації про дії Користувачів на сайті, покращення якості сайту та його змісту.</p>
<h3>5. Правові підстави обробки персональних даних</h3>
<p>5.1. Оператор обробляє персональні дані Користувача лише у разі їх заповнення та/або відправлення Користувачем самостійно через спеціальні форми, розташовані на сайті https://andorinha-pt.com та його під-доменах. Заповнюючи відповідні форми та/або надсилаючи свої персональні дані Оператору, Користувач висловлює свою згоду з цією Політикою.</p>
<p>5.2. Оператор обробляє знеособлені дані про Користувача у випадку, якщо це дозволено в налаштуваннях браузера Користувача (включено збереження файлів cookie та використання технології JavaScript).</p>
<h3>6. Порядок збору, зберігання, передачі та інших видів обробки персональних даних</h3>
<p>Безпека Персональних даних, що обробляються Оператором, забезпечується шляхом реалізації правових, організаційних та технічних заходів, необхідних для виконання у повному обсязі вимог чинного законодавства у сфері захисту Персональних даних.</p>
<p>6.1. Оператор забезпечує збереження Персональних даних та вживає всіх можливих заходів, що виключають доступ до персональних даних не уповноважених осіб.</p>
<p>6.2. Персональні дані Користувача ніколи, ні за яких умов не будуть передані третім особам, за винятком випадків, пов'язаних із виконанням чинного законодавства.</p>
<p>6.3. У разі виявлення неточностей у Персональних даних, Користувач може актуалізувати їх самостійно, шляхом направлення Оператору повідомлення на адресу електронної пошти Оператора через контактну форму на сайті з позначкою «Актуалізація Персональних даних».</p>
<p>6.4. Термін обробки Персональних даних є необмеженим. Користувач може в будь-який момент відкликати свою згоду на обробку Персональних даних, надіславши Оператору повідомлення через створення відповідного тикета для Оператора через контактну форму на сайті з позначкою «Видалити користувача». У цьому випадку обліковий запис Користувача буде безповоротно видалено.</p>
<h3>7. Транскордонна передача персональних даних</h3>
<p>7.1. Транскордонна передача Персональних даних здійснюється виключно в рамках законодавства Євросоюзу. Оператор до початку здійснення транскордонної передачі Персональних даних зобов'язаний переконатися, що іноземною державою, на територію якої передбачається здійснювати передачу Персональних даних, забезпечується надійний захист прав суб'єктів Персональних даних.</p>
<p>7.2. Транскордонна передача Персональних даних на території іноземних держав, що не відповідають вищевказаним вимогам, може здійснюватися тільки у разі наявності згоди в письмовій формі суб'єкта Персональних даних на транскордонну передачу його Персональних даних та/або виконання договору, стороною якого є суб'єкт Персональних даних.</p>
<h3>8. Заключні положення</h3>
<p>8.1. Користувач може отримати будь-які роз'яснення з питань, що цікавляться щодо обробки його Персональних даних, звернувшись до Оператора за допомогою електронної пошти через контактну форму на сайті.</p>
<p>8.2. У цьому документі будуть відображені будь-які зміни політики обробки Персональних даних Оператором. Політика діє безстроково до заміни її новою версією.</p>
<p>8.3. Актуальна версія Політики у вільному доступі розташована в мережі Інтернет за адресою https://andorinha-pt.com/ru/doc/privacy-policy.html</p>
<p>8.4. Актуальна версія Політики перекладено багатьма мовами, які використовуються сайтами домену https://andorinha-pt.com. За різних трактувань будь-якого слова, терміна, фрази пріоритетним вважається її значення в українській версії цієї Політики.</p>
