<?php

/**
 * @package    ArtInWebCMS.Core
 *
 * @copyright  (C) 2024 Igor Kruk <https://cms.artinweb.biz>
 * @license    GNU General Public License version 2 or later; see LICENSE.txt
 */

defined('AIW_CMS') or die;

use Core\Plugins\Ssl;
use Core\{Session, Trl};

$p30px = Session::getRtl() === 0 ? 'style="padding-left: 30px"' : 'style="padding-right: 30px"';

?>
<h1 class="uk-text-center">Угода користувача</h1>
<h3>1. Загальні положення</h3>
<p>1.1. Дана Угода користувача (далі – Угода) відноситься до сайту <strong><?= Trl::_('OV_SITE_FULL_NAME') ?></strong>, розташованого за адресою <strong><?= Ssl::getLink() ?></strong> та до всіх відповідних сайтів, пов'язаних з сайтом <strong><?= Trl::_('OV_SITE_FULL_NAME') ?></strong>.</p>
<p>1.2. Сайт <strong><?= Trl::_('OV_SITE_FULL_NAME') ?></strong> (далі – Сайт) є власністю <?= Trl::_('OV_OWNER_NAME') ?>.</p>
<p>1.3. Ця Угода регулює відносини між Адміністрацією Сайту <strong><?= Trl::_('OV_SITE_FULL_NAME') ?></strong> (далі – Адміністрація Сайту) та Користувачем цього Сайту.</p>
<p>1.4. Адміністрація Сайту залишає за собою право в будь-який час змінювати, додавати або видаляти пункти цієї Угоди без попередження Користувача.</p>
<p>1.5. Продовження використання Сайту Користувачем означає прийняття Угоди та змін, внесених до цієї Угоди.</p>
<p>1.6. Користувач несе персональну відповідальність за перевірку цієї Угоди на наявність змін у ній.</p>
<h3>2. Визначення термінів</h3>
<p>2.1. Наведені нижче терміни мають для цілей цієї Угоди таке значення:</p>
<p>2.2. <strong><?= Trl::_('OV_SITE_FULL_NAME') ?></strong> – Сайт, розташований на доменному імені <strong><?= Ssl::getLink() ?></strong>, який здійснює свою діяльність за допомогою Інтернет-ресурсу та супутніх йому сервісів.</p>
<p>2.3. Сайт – Інтернет-ресурс, що містить інформацію про Послуги, Продавця, статті, нотатки, коментарі, що дозволяє здійснити вибір, замовлення та (або) придбання Послуг, залишити відгук або коментар до статті або блогу.</p>
<p>2.4. Адміністрація Сайту – уповноважені співробітники на управління Сайтом, які діють від імені <?= Trl::_('OV_OWNER_NAME') ?>.</p>
<p>2.5. Користувач Сайту (далі – Користувач) – особа, яка має доступ до Сайту через мережу Інтернет та використовує Сайт.</p>
<p>2.6. Зміст Сайту (далі – Зміст) – результати інтелектуальної діяльності, включаючи тексти літературних творів, їх назви, передмови, анотації, статті, ілюстрації, обкладинки, музичні твори з текстом або без тексту, графічні, текстові, фотографічні, похідні, складові та інші твори, логотипи, програми для ЕОМ, бази даних, а також дизайн, структура, вибір, координація, зовнішній вигляд, загальний стиль та розташування цього Змісту, що входить до складу Сайту та інші об'єкти інтелектуальної власності, всі разом та/або окремо, що містяться на Сайті.</p>
<h3>3. Предмет угоди</h3>
<p>3.1 Предметом цієї Угоди є надання Користувачеві доступу до послуг, матеріалів, статей, блогів, що надаються.</p>
<p <?= $p30px ?>>3.1.1. Сайт надає Користувачу такі види послуг (сервісів):</p>
<ul>
    <li>доступ до електронного контенту на безкоштовній основі, з правом придбання (завантаження), перегляду контенту;</li>
    <li>доступ до засобів пошуку та навігації Сайту;</li>
    <li>надання Користувачеві можливості розміщення повідомлень, коментарів, рецензій Користувачів, виставлення оцінок контенту Сайту;</li>
    <li>доступ до інформації про послуги та інформації про придбання послуг;</li>
    <li>інші види послуг (сервісів), що реалізуються на сторінках Сайту.</li>
</ul>
<p <?= $p30px ?>>3.1.2. Під дію цієї Угоди підпадають усі послуги (сервіси) Сайту, що існують (реально функціонують) на даний момент, а також будь-які їх подальші модифікації та додаткові послуги (сервіси) Сайту, що з'являються надалі.</p>
<p>3.2. Доступ до Сайту надається безкоштовно.</p>
<p>3.3. Ця Угода є публічною офертою. Отримуючи доступ до Сайту Користувач вважається таким, що приєднався до цієї Угоди.</p>
<p>3.4. Використання матеріалів та сервісів Сайту регулюється нормами чинного законодавства Європейського Союзу.</p>
<h3>4. Права та обов'язки сторін</h3>
<p>4.1. Адміністрація Сайту має право:</p>
<p <?= $p30px ?>>4.1.1. Змінювати правила користування Сайтом, а також змінювати зміст цього Сайту. Зміни набувають чинності з моменту опублікування нової редакції Угоди на Сайті.</p>
<p <?= $p30px ?>>4.1.2. Обмежити доступ до Сайту у разі порушення Користувачем умов цієї Угоди.</p>
<p>4.2. Користувач має право:</p>
<p <?= $p30px ?>>4.2.1. Отримати доступ до використання Сайту після дотримання вимог реєстрації.</p>
<p <?= $p30px ?>>4.2.2. Користуватися всіма послугами, що є на Сайті, а також набувати будь-які Товари, Послуги, що пропонуються на Сайті.</p>
<p <?= $p30px ?>>4.2.3. Задавати будь-які питання стосовно послуг з реквізитів, які знаходяться в розділі Сайту «Контакти».</p>
<p <?= $p30px ?>>4.2.4. Користуватися Сайтом виключно з метою та порядком, передбаченим Угодою та не заборонених законодавством Португалії.</p>
<p>4.3. Користувач Сайту зобов'язується:</p>
<p <?= $p30px ?>>4.3.1. Надавати за запитом Адміністрації Сайту додаткову інформацію, яка має безпосереднє відношення до послуг цього Сайту.</p>
<p <?= $p30px ?>>4.3.2. Дотримуватись майнових та немайнових прав авторів та інших правовласників при використанні Сайту.</p>
<p <?= $p30px ?>>4.3.3. Не вживати дій, які можуть розглядатися як такі, що порушують нормальну роботу Сайту.</p>
<p <?= $p30px ?>>4.3.4. Не розповсюджувати з використанням Сайту будь-яку конфіденційну та охоронювану законодавством Європейського Союзу інформацію про фізичних чи юридичних осіб.</p>
<p <?= $p30px ?>>4.3.5. Уникати будь-яких дій, внаслідок яких може бути порушена конфіденційність інформації, що охороняється законодавством Європейського Союзу.</p>
<p <?= $p30px ?>>4.3.6. Не використовувати Сайт для поширення інформації рекламного характеру, інакше як за згодою Адміністрації Сайту.</p>
<p <?= $p30px ?>>4.3.7. Не використовувати сервіси Сайту з метою:</p>
<ul>
    <li>завантаження контенту, який є незаконним, порушує будь-які права третіх осіб;</li>
    <li>пропагує насильство, жорстокість, ненависть та (або) дискримінацію за расовою, національною, статевою, релігійною, соціальною ознаками;</li>
    <li>містить недостовірні відомості та (або) образи на адресу конкретних осіб, організацій, органів влади;</li>
    <li>спонукання до здійснення протиправних дій, а також сприяння особам, дії яких спрямовані на порушення обмежень та заборон, що діють на території Європейського Союзу;</li>
    <li>порушення прав неповнолітніх осіб та (або) заподіяння їм шкоди у будь-якій формі;</li>
    <li>ущемлення прав меншин;</li>
    <li>подання себе за іншу людину чи представника організації та (або) спільноти без достатніх на те прав, у тому числі за співробітників цього Сайту;</li>
    <li>введення в оману щодо властивостей та характеристик будь-якої Послуги з каталогу Сайту, розміщеного на Сайті;</li>
    <li>некоректного порівняння Послуг, а також формування негативного ставлення до осіб, які не користуються певними Послугами або засудження таких осіб.</li>
</ul>
<p>4.4. Користувачеві забороняється:</p>
<p <?= $p30px ?>>4.4.1. Використовувати будь-які пристрої, програми, процедури, алгоритми та методи, автоматичні пристрої або еквівалентні ручні процеси для доступу, придбання, копіювання або відстеження змісту цього Сайту;</p>
<p <?= $p30px ?>>4.4.2. Порушувати належне функціонування Сайту;</p>
<p <?= $p30px ?>>4.4.3. Будь-яким способом обходити навігаційну структуру Сайту для отримання чи спроби отримання будь-якої інформації, документів чи матеріалів будь-якими засобами, які спеціально не представлені сервісами цього Сайту;</p>
<p <?= $p30px ?>>4.4.4. Несанкціонований доступ до функцій Сайту, будь-яких інших систем або мереж, що належать до цього Сайту, а також до будь-яких послуг, що пропонуються на Сайті;</p>
<p <?= $p30px ?>>4.4.5. Порушувати систему безпеки або автентифікації на Сайті або в будь-якій мережі, яка стосується Сайту.</p>
<p <?= $p30px ?>>4.4.6. Виконувати зворотний пошук, відстежувати чи намагатися відстежувати будь-яку інформацію про будь-якого іншого Користувача Сайту.</p>
<p <?= $p30px ?>>4.4.7. Використовувати Сайт та його Зміст у будь-яких цілях, заборонених законодавством ЄС, а також підбурювати будь-яку незаконну діяльність або іншу діяльність, яка порушує права або інших осіб.</p>
<h3>5. Використання сайту</h3>
<p>5.1. Сайт та Зміст, що входить до складу Сайту, належить та керується Адміністрацією Сайту.</p>
<p>5.2. Зміст Сайту не може бути скопійований, опублікований, відтворений, переданий або розповсюджений будь-яким способом, а також розміщений у глобальній мережі «Інтернет» без попередньої письмової згоди Адміністрації Сайту.</p>
<p>5.3. Зміст Сайту захищено авторським правом, законодавством про товарні знаки, а також іншими правами, пов'язаними з інтелектуальною власністю, та законодавством щодо недобросовісної конкуренції.</p>
<p>5.4. Будь-які дії Користувача на Сайті (крім перегляду загальнодоступних сторінок Сайту) вимагають створення облікового запису Користувача.</p>
<p>5.5. Користувач несе персональну відповідальність за збереження конфіденційності інформації облікового запису, включаючи пароль, а також за всю без винятку діяльність, яка ведеться від імені Користувача облікового запису.</p>
<p <?= $p30px ?>>5.5.1. Адреса електронної пошти та телефон Користувача зберігаються в базі даних Сайту в зашифрованому вигляді з використанням плаваючого ключа (одне й те саме значення при будь-якій кількості записів до бази даних матиме різне значення).</p>
<p>5.6. Користувач повинен негайно повідомити Адміністрацію Сайту про несанкціоноване використання його облікового запису чи пароля або будь-яке інше порушення системи безпеки.</p>
<p>5.7. Адміністрація Сайту має право в односторонньому порядку анулювати обліковий запис Користувача, якщо він не використовувався більше 24 календарних місяців поспіль без повідомлення Користувача.</p>
<p>5.8. Ця Угода поширює свої дії на всі додаткові положення та умови купівлі Послуг та їх надання, що надаються на Сайті.</p>
<p>5.9. Інформація, що розміщується на Сайті, не повинна тлумачитися як зміна цієї Угоди.</p>
<p>5.10. Адміністрація Сайту має право в будь-який час без повідомлення Користувача вносити зміни до переліку послуг, що пропонуються на Сайті, та (або) у ціни, що застосовуються щодо їх реалізації та (або) послуг, що надаються Сайтом.</p>
<p>5.11. Документи, зазначені у даному пункті цієї Угоди, регулюють у відповідній частині та поширюють свою дію на використання Користувачем Сайту. Ця Угода містить такі документи:</p>
<p <?= $p30px ?>>5.11.1. Політика конфіденційності;</p>
<p <?= $p30px ?>>5.11.2. Угода користувача;</p>
<p <?= $p30px ?>>5.11.3. Умови використання файлів cookie;</p>
<p>5.12. Будь-який із документів, перерахованих у пункті 5.11. ця Угода може підлягати оновленню. Зміни набирають чинності з моменту їх опублікування на Сайті.</p>
<h3>6. Відповідальність</h3>
<p>6.1. Будь-які збитки, які Користувач може зазнати у разі навмисного чи необережного порушення будь-якого положення цієї Угоди, а також внаслідок несанкціонованого доступу до комунікацій іншого Користувача, Адміністрацією Сайту не відшкодовуються.</p>
<p>6.2. Адміністрація Сайту не несе відповідальності за:</p>
<p <?= $p30px ?>>6.2.1. Затримки або збої в процесі здійснення операції, що виникли внаслідок непереборної сили, а також будь-якого випадку несправностей у телекомунікаційних, комп'ютерних, електричних та інших суміжних системах.</p>
<p <?= $p30px ?>>6.2.2. Дії систем переказів, банків, платіжних систем та за затримки пов'язані з їх роботою.</p>
<p <?= $p30px ?>>6.2.3. Належне функціонування Сайту, якщо Користувач не має необхідних технічних засобів для його використання, а також не несе жодних зобов'язань щодо забезпечення користувачів такими засобами.</p>
<h3>7. Порушення умов користувальницької угоди</h3>
<p>7.1. Адміністрація Сайту вправі розкрити будь-яку зібрану про Користувача даного Сайту інформацію, якщо розкриття необхідно у зв'язку з розслідуванням або скаргою щодо неправомірного використання Сайту або для встановлення (ідентифікації) Користувача, який може порушувати або втручатися у права Адміністрації Сайту або права інших Користувачів Сайту.</p>
<p>7.2. Адміністрація Сайту має право розкрити будь-яку інформацію про Користувача, яку вважатиме за необхідну для виконання положень чинного законодавства чи судових рішень, забезпечення виконання умов цієї Угоди, захисту прав чи безпеки <?= Trl::_('OV_OWNER_NAME') ?>, Користувачів.</p>
<p>7.3. Адміністрація Сайту має право розкрити інформацію про Користувача, якщо чинне законодавство потребує такого розкриття.</p>
<p>7.4. Адміністрація Сайту має право без попереднього повідомлення Користувача припинити та (або) заблокувати доступ до Сайту, якщо Користувач порушив цю Угоду або умови користування Сайтом, що містяться в інших документах, а також у разі припинення дії Сайту або через технічну неполадку або проблему.</p>
<p>7.5. Адміністрація Сайту не несе відповідальності перед Користувачем або третіми особами за припинення доступу до Сайту у разі порушення Користувачем будь-якого положення цієї Угоди або іншого документа, що містить умови користування Сайтом.</p>
<h3>8. Вирішення спорів</h3>
<p>8.1. У разі виникнення будь-яких розбіжностей чи суперечок між Сторонами цієї Угоди обов'язковою умовою до звернення до суду є пред'явлення претензії (письмової пропозиції щодо добровільного врегулювання спору).</p>
<p>8.2. Одержувач претензії протягом 30 календарних днів з дня її отримання письмово повідомляє заявника претензії про результати розгляду претензії.</p>
<p>8.3. За неможливості вирішити спір у добровільному порядку будь-яка із Сторін має право звернутися до суду за захистом своїх прав, які надано їм чинним законодавством.</p>
<p>8.4. Будь-який позов щодо умов використання Сайту повинен бути пред'явлений протягом 7 (семи) днів після виникнення підстав для позову, за винятком захисту авторських прав на матеріали Сайту, що охороняються відповідно до законодавства. За порушення умов цього пункту будь-який позов або підстави для позову погашаються позовною давністю.</p>
<h3>9. Додаткові умови</h3>
<p>9.1. Адміністрація Сайту не приймає зустрічних пропозицій від Користувача щодо змін цієї Угоди.</p>
<p>9.2. Відгуки, коментарі Користувача, розміщені на Сайті, не є конфіденційною інформацією та можуть бути використані Адміністрацією Сайту без обмежень.</p>
