<?php

defined('AIW_CMS') or die;

return [
    'FP_01' => 'Відкрийте для себе Португалію разом із нами!',
    'FP_02' => 'Насолоджуйтеся вашою відпусткою мрії!',
    'FP_03' => 'Створіть свій тур разом із нами!',
    'FP_04' => 'Унікальні екскурсії по всій Португалії!',
    'FP_05' => 'Найкращі пропозиції за доступними цінами!',

    'FP_WELCOME'                    => 'Ласкаво просимо до Португалії!',
    'FP_WELCOME_TEXT'               => 'Якщо Ви мрієте про незабутній відпочинок у казково красивій країні, то Вам до Португалії! Португалія – дивовижна країна, з яскравою і величною історією, самобутньою культурою, щедрим сонцем і нескінченними пляжами Атлантичного океану. Пропонуємо Вам вирушити в саме серце цієї чудової країни…',
    'FP_WHY_ARE_WE'                 => 'Чому ми',
    'FP_COMFORT_AND_SAFETY'         => 'КОМФОРТ І БЕЗПЕКА',
    'FP_COMFORT_AND_SAFETY_TEXT'    => 'Для екскурсій використовується тільки комфортабельний транспорт для невеликих груп до 8 осіб.   Ми забираємо з готелю або від зазначеного місця проживання і доставляємо назад після екскурсії. Маємо Сертифікат «Clean &amp; Safe», який гарантує дотримання стандартів гігієни та безпеки, необхідних для боротьби з Covid-19.',
    'FP_PERSONALISED_APPROACH'      => 'ІНДИВІДУАЛЬНИЙ ПІДХІД',
    'FP_PERSONALISED_APPROACH_TEXT' => 'До кожного клієнта у нас індивідуальний підхід, тому варіанти екскурсій, які ви знайдете на цьому сайті, можна комбінувати і видозмінювати залежно від вашого смаку та інтересів. Напишіть нам, і ми разом складемо для вас індивідуальний маршрут екскурсії або багатоденного туру.',
    'FP_LEGAL_ACTIVITY'             => 'ЛЕГАЛЬНА ДІЯЛЬНІСТЬ',
    'FP_LEGAL_ACTIVITY_TEXT'        => 'Ми маємо ліцензію Міністерства з туризму Португалії на здійснення туристичної діяльності (RNAAT nº 303/2017), а також усі необхідні страховки.  Для нас дуже важливо зробити ваше перебування максимально комфортним, цікавим і безпечним.',
];
