<?php

defined('AIW_CMS') or die;

return [
    'MP_01' => 'Безпека! Швидкість! Простота!',
    'MP_02' => 'Безпека!',
    'MP_03' => 'Швидкість!',
    'MP_04' => 'Простота!',

    'MP_01_TEXT'         => 'Система управління контентом <strong>ArtInWeb CMS</strong> створена для впевненої захищеності ваших даних! Нашою командою створені всі умови для ваших безмежних можливостей свободи творчості та швидкості реалізації ваших задумів!<br><br>За простим інтерфейсом нашої <strong>AIW&nbsp;CMS</strong>, криється можливість нескінченного масштабування та розширення ваших проектів будь якої складності, і будь якого напрямку!<br><br><strong>Швидкість та безпека – наше все!</strong> Спробуйте – і ви переконаєтесь.',
    'MP_WHY_ARE_WE'      => 'Чому ми',
    'MP_SIMPLICITY'      => 'ПРОСТОТА',
    'MP_SIMPLICITY_TEXT' => 'Створюйте простими діями контент будь якої складності однаково легко, як однією мовою, так і будь якою їх кількістю!',
    'MP_SAFETY'          => 'БЕЗПЕКА',
    'MP_SAFETY_TEXT'     => 'Отримайте безпечне та прогнозоване користування вашим сервісом ВСІМА вашими користувачами. Як добрими… так і поганими.',
    'MP_SPEED'           => 'ШВИДКІСТЬ',
    'MP_SPEED_TEXT'      => 'Отримайте швидкість та передбачуваність чистого PHP та одного з найкращих CSS фреймворків – UiKit.',
];
