<?php

defined('AIW_CMS') or die;

return [
    'MAIN_01'              => 'Безопасность! Скорость! Простота!',
    'MAIN_02'              => 'Безопасность!',
    'MAIN_03'              => 'Скорость!',
    'MAIN_04'              => 'Простота!',
    'MAIN_01_TEXT'         => 'Система управления контентом <strong>ArtinWeb CMS</strong> предназначена для уверенной безопасности ваших данных! Наша команда создала все условия для ваших безграничных возможностей свободы творчества и скорости реализации ваших идей!<br><br>За простым интерфейсом нашей <strong>AIW CMS</strong>, прячется возможность бесконечного масштабирования и расширения ваших проектов любой сложности и любого направления!<br><br><strong>Скорость и безопасность - наше все!</strong> Попробуйте - и вы будете убеждены.',
    'MAIN_WHY_ARE_WE'      => 'Почему мы',
    'MAIN_SIMPLICITY'      => 'ПРОСТОТА',
    'MAIN_SIMPLICITY_TEXT' => 'Создавайте простыми действиями содержание любой сложности одинаково просто, как на одном языке, так и на любом их количестве!',
    'MAIN_SAFETY'          => 'БЕЗОПАСНОСТЬ',
    'MAIN_SAFETY_TEXT'     => 'Получите безопасное и прогнозируемое пользование вашим сервисом ВСЕМИ вашими пользователями. Как хорошими... так и плохими.',
    'MAIN_SPEED'           => 'СКОРОСТЬ',
    'MAIN_SPEED_TEXT'      => 'Получите скорость и предсказуемость чистого PHP и одного из лучших CSS/JS фреймворков - UiKit.',
];
