<?php

defined('AIW_CMS') or die;

return [
    'MP_01' => 'Откройте для себя Португалию вместе с нами!',
    'MP_02' => 'Насладитесь вашим отпуском мечты!',
    'MP_03' => 'Создайте свой тур вместе с нами!',
    'MP_04' => 'Уникальные экскурсии по всей Португалии!',
    'MP_05' => 'Лучшие предложения по доступным ценам!',

    'MP_WELCOME'                    => 'Добро пожаловать в Португалию!',
    'MP_WELCOME_TEXT'               => 'Если Вы мечтаете о незабываемом отдыхе в сказочно красивой стране, то Вам в Португалию! Португалия — удивительная страна, с яркой и величественной историей, самобытной культурой, щедрым солнцем и бесконечными пляжами Атлантического океана. Предлагаем Вам отправиться в самое сердце этой чудесной страны…',
    'MP_WHY_ARE_WE'                 => 'Почему мы',
    'MP_SIMPLICITY'         => 'КОМФОРТ И БЕЗОПАСНОСТЬ',
    'MP_SIMPLICITY_TEXT'    => 'Для экскурсий используется только комфортабельный транспорт для небольших групп до 8 человек.   Мы забираем из отеля или от указанного места проживания и доставляем обратно после экскурсии. Имеем Сертификат "Clean &amp; Safe", который гарантирует соблюдение стандартов гигиены и безопасности, необходимых для борьбы с Covid-19.',
    'MP_SAFETY'      => 'ИНДИВИДУАЛЬНЫЙ ПОДХОД',
    'MP_SAFETY_TEXT' => 'К каждому клиенту у нас индивидуальный подход, поэтому варианты экскурсий, которые вы найдёте на этом сайте можно комбинировать и видоизменять в зависимости от вашего вкуса и интересов. Напишите нам, и мы вместе составим для вас индивидуальный маршрут экскурсии или многодневного тура.',
    'MP_SPEED'             => 'ЛЕГАЛЬНАЯ ДЕЯТЕЛЬНОСТЬ',
    'MP_SPEED_TEXT'        => 'Мы имеем лицензию Министерства по туризму Португалии на осуществление туристической деятельности (RNAAT nº 303/2017), а также все необходимые страховки.  Для нас очень важно сделать ваше пребывание максимально комфортным, интересным и безопасным.',
];
