<?php

/**
 * @package    ArtInWebCMS.doc
 *
 * @copyright  (C) 2024 Igor Kruk <https://cms.artinweb.biz>
 * @license    GNU General Public License version 2 or later; see LICENSE.txt
 */

use Core\Trl;

defined('AIW_CMS') or die;

?>
<h1 class="uk-text-center">Политика в отношении обработки Персональных данных</h1>
<h3>1. Общие положения</h3>
<p>Настоящая политика обработки Персональных данных составлена в соответствии с требованиями Законов Европейского Союза «О защите Персональных данных» и/или аналогичных, и определяет порядок обработки Персональных данных и меры по обеспечению безопасности Персональных данных, предпринимаемые сайтом <strong>andorinha-pt.com</strong> (далее – Оператор).</p>
<p>1.1.&#160;Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его Персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.</p>
<p>1.2.&#160;Настоящая политика Оператора в отношении обработки Персональных данных (далее – Политика) применяется ко всей информации, которую Оператор может получить о посетителях веб-сайтов домена https://andorinha-pt.com и всех его под-доменов.</p>
<h3>2. Основные понятия, используемые в Политике</h3>
<p>2.1.&#160;<em>Автоматизированная обработка Персональных данных</em> – обработка Персональных данных с помощью средств вычислительной техники;</p>
<p>2.2.&#160;<em>Блокирование Персональных данных</em> – временное прекращение обработки Персональных данных (за исключением случаев, если обработка необходима для уточнения Персональных данных);</p>
<p>2.3.&#160;<em>Веб-сайт</em> – совокупность графических и информационных материалов, а также программ для ЭВМ и баз данных, обеспечивающих их доступность в сети интернет по сетевому адресу https://andorinha-pt.com и его под-доменах;</p>
<p>2.4.&#160;<em>Информационная система Персональных данных</em> — совокупность содержащихся в базах данных Персональных данных, и обеспечивающих их обработку информационных технологий и технических средств;</p>
<p>2.5.&#160;<em>Обезличивание Персональных данных</em> — действия, в результате которых невозможно определить без использования дополнительной информации принадлежность Персональных данных конкретному Пользователю или иному субъекту Персональных данных;</p>
<p>2.6.&#160;<em>Обработка Персональных данных</em> – любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации и/или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение Персональных данных;</p>
<p>2.7.&#160;<em>Оператор</em> – государственный орган, муниципальный орган, юридическое или физическое лицо, самостоятельно или совместно с другими лицами организующие и/или осуществляющие обработку Персональных данных, а также определяющие цели обработки Персональных данных, состав Персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными;</p>
<p>2.8.&#160;<em>Персональные данные</em> – любая информация, относящаяся прямо или косвенно к определенному или определяемому Пользователю веб-сайта https://andorinha-pt.com и его под-доменов;</p>
<p>2.9.&#160;<em>Пользователь</em> – любой посетитель веб-сайта https://andorinha-pt.com и его под-доменов;</p>
<p>2.10.&#160;<em>Предоставление Персональных данных</em> – действия, направленные на раскрытие Персональных данных определенному лицу или определенному кругу лиц;</p>
<p>2.11.&#160;<em>Распространение Персональных данных</em> – любые действия, направленные на раскрытие Персональных данных неопределенному кругу лиц (передача Персональных данных) или на ознакомление с персональными данными неограниченного круга лиц, в том числе обнародование Персональных данных в средствах массовой информации, размещение в информационно-телекоммуникационных сетях или предоставление доступа к персональным данным каким-либо иным способом;</p>
<p>2.12.&#160;<em>Трансграничная передача Персональных данных</em> – передача Персональных данных на территорию иностранного государства органу власти иностранного государства, иностранному физическому или иностранному юридическому лицу;</p>
<p>2.13.&#160;<em>Уничтожение Персональных данных</em> – любые действия, в результате которых персональные данные уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания Персональных данных в информационной системе Персональных данных и/или уничтожаются материальные носители Персональных данных.</p>
<h3>3. Какие Персональные данные Пользователя обрабатываются</h3>
<p>Для корректной работы сайта и предоставления услуг Оператором на должном уровне, Оператор может обрабатывать следующие Персональные данные Пользователя:</p>
<p>3.1.&#160;Фамилия, имя, отчество;<br>
    3.2.&#160;Адрес электронной почты;<br>
    3.3.&#160;Номер телефона;<br>
    3.4.&#160;Фотографии;<br>
    3.5.&#160;Также на сайте происходит сбор и обработка обезличенных данных о посетителях, в т.ч. файлов «cookie».</p>
<p>Вышеперечисленные данные далее по тексту Политики объединены общим понятием <em>Персональные данные</em>.</p>
<h3>4. Цели обработки Персональных данных</h3>
<p>4.1.&#160;Цель обработки Персональных данных Пользователя:<br>
    – информирование Пользователя посредством отправки электронных писем;<br>
    – предоставление доступа Пользователю к сервисам, информации и/или материалам, содержащимся на веб-сайте;<br>
    – защита прав Пользователей и их контрагентов от злоумышленников.</p>
<p>4.2.&#160;Также Оператор имеет право направлять Пользователю уведомления о новых продуктах и услугах, специальных предложениях и различных событиях. Пользователь всегда может отказаться от получения информационных сообщений, направив Оператору письмо с контактной формы на сайте с пометкой «Отказ от уведомлений о новых продуктах и услугах и специальных предложениях».</p>
<p>4.3.&#160;Обезличенные данные Пользователей, собираемые с помощью сервисов интернет-статистики, служат для сбора информации о действиях Пользователей на сайте, улучшения качества сайта и его содержания.</p>
<h3>5. Правовые основания обработки Персональных данных</h3>
<p>5.1.&#160;Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или отправки Пользователем самостоятельно через специальные формы, расположенные на сайте https://andorinha-pt.com и его под-доменах. Заполняя соответствующие формы и/или отправляя свои персональные данные Оператору, Пользователь выражает свое согласие с данной Политикой.</p>
<p>5.2.&#160;Оператор обрабатывает обезличенные данные о Пользователе в случае, если это разрешено в настройках браузера Пользователя (включено сохранение файлов «cookie» и использование технологии JavaScript).</p>
<h3>6. Порядок сбора, хранения, передачи и других видов обработки Персональных данных</h3>
<p>Безопасность Персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований действующего законодательства в области защиты Персональных данных.</p>
<p>6.1.&#160;Оператор обеспечивает сохранность Персональных данных и принимает все возможные меры, исключающие доступ к персональным данным не уполномоченных лиц.</p>
<p>6.2.&#160;Персональные данные Пользователя никогда, ни при каких условиях не будут переданы третьим лицам, за исключением случаев, связанных с исполнением действующего законодательства.</p>
<p>6.3.&#160;В случае выявления неточностей в Персональных данных, Пользователь может актуализировать их самостоятельно, путем направления Оператору уведомление на адрес электронной почты Оператора через контактную форму на сайте с пометкой «Актуализация Персональных данных».</p>
<p>6.4.&#160;Срок обработки Персональных данных является неограниченным. Пользователь может в любой момент отозвать свое согласие на обработку Персональных данных, направив Оператору уведомление посредством создания соответствующего тикета для Оператора через контактную форму на сайте с пометкой «Удалить пользователя». В этом случае, учётная запись Пользователя будет безвозвратно удалена.</p>
<h3>7. Трансграничная передача Персональных данных</h3>
<p>7.1.&#160;Трансграничная передача Персональных данных осуществляется исключительно в рамках законодательства Евросоюза. Оператор до начала осуществления трансграничной передачи Персональных данных обязан убедиться в том, что иностранным государством, на территорию которого предполагается осуществлять передачу Персональных данных, обеспечивается надежная защита прав субъектов Персональных данных.</p>
<p>7.2.&#160;Трансграничная передача Персональных данных на территории иностранных государств, не отвечающих вышеуказанным требованиям, может осуществляться только в случае наличия согласия в письменной форме субъекта Персональных данных на трансграничную передачу его Персональных данных и/или исполнения договора, стороной которого является субъект Персональных данных.</p>
<h3>8. Заключительные положения</h3>
<p>8.1.&#160;Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его Персональных данных, обратившись к Оператору с помощью электронной почты через контактную форму на сайте.</p>
<p>8.2.&#160;В данном документе будут отражены любые изменения политики обработки Персональных данных Оператором. Политика действует бессрочно до замены её новой версией.</p>
<p>8.3.&#160;Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу https://andorinha-pt.com/ru/doc/privacy-policy.html</p>
<p>8.4.&#160;Актуальная версия Политики переведена на многие языки, которые используются сайтами домена https://andorinha-pt.com. При разных трактованиях какого либо слова, термина, фразы приоритетным считается её значение в украинской версии этой Политики.</p>
