<h1 class="uk-text-center">Условия использования файлов куки</h1>
<p>Сайт <strong>Владимира и Ольги Грязновых</strong>, в дальнейшем <em>Сайт</em>, что работает на домене <em>andorinha-pt.com</em> и его под-доменах, используются файлы <em>cookie</em> для обеспечения авторизации пользователей, а также препятствованию противоправных действий в отношении <em>Сайта</em> со стороны злоумышленников.</p>
<p><em>Сайты</em> используют несколько <em>cookie-файлов</em>.</p>
<p><em>Cookie-файл</em> <strong>SESSION</strong> используется для хранения <em>ключа сессии</em>.</p>
<p><em>Cookie-файл</em> <strong>SESSION</strong> хранится для авторизованных пользователей в течении 2-х недель. Для не авторизованных пользователей в течении 15 минут с момента крайнего входа на <em>Сайт</em>.</p>
<p>В <em>cookie-файле</em> <strong>messages_cookies</strong> хранится информация о подтверждении согласия Пользователя на использование <em>Сайта</em> согласно Условий пользования сайтом, как Публичного договора оферты.</p>
<p>На компьютерах Пользователей cookie-файл <strong>messages_cookies</strong> храниться в течение двух недель с момента крайнего обращения к Сайту.</p>
<p>В <em>cookie-файле</em> <strong>time_difference</strong> хранится время (в секундах) разницы между текущим временем Пользователя и Всемирным координированным временем.</p>
<p>Если Пользователь не согласен с использованием <em>Сайтом</em> cookie-файлов согласно Условиям пользования сайтом, как Публичным договором оферты, Пользователь не может пользоваться Сайтом.</p>
<p>Любое продолжение использования Пользователем <em>Сайта</em>, является актом акцепта Условий пользования сайтом, как Публичного договора оферты.</p>
